---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelCurveArrArrayIterator
source: html/601aa16c-9034-e852-bf0e-4c23e015115a.htm
---
# ModelCurveArrArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.